{
  "skills": [
    {
      "name": "Angular",
      "category": "Frontend"
    },
    {
      "name": "TypeScript",
      "category": "Frontend"
    },
    {
      "name": "CSS",
      "category": "Frontend"
    },
    {
      "name": "HTML",
      "category": "Frontend"
    },
    {
      "name": "Expo",
      "category": "Frontend"
    },
    {
      "name": "Node.js",
      "category": "Backend"
    },
    {
      "name": "MongoDB",
      "category": "Database"
    },
    {
      "name": "PHP",
      "category": "Backend"
    },
    {
      "name": "C",
      "category": "Backend"
    },
    {
      "name": "Algorithmie",
      "category": "Others"
    },
    {
      "name": "Python",
      "category": "Backend"
    },
    {
      "name": "Java",
      "category": "Backend"
    },
    {
      "name": "SQL",
      "category": "Database"
    },
    {
      "name": "Git",
      "category": "Others"
    },
    {
      "name": "AWS",
      "category": "Others"
    },
    {
      "name": "Docker",
      "category": "Others"
    },
    {
      "name": "MariaDB",
      "category": "Database"
    },
    {
      "name": "React Native",
      "category": "Frontend"
    },
    {
      "name": "Travail en équipe",
      "category": "Others"
    },
    {
      "name": "Gestion des tests",
      "category": "Others"
    },
    {
      "name": "Automatisation",
      "category": "Others"
    },
    {
      "name": "Gestion d'API",
      "category": "Database"
    },
    {
      "name": "Mathématiques",
      "category": "Others"
    },
    {
      "name": "Make",
      "category": "Others"
    },
    {
      "name": "Zapier",
      "category": "Others"
    }
    
    
  ],
  "experiences": [
    {
      "title": "Développeur stagiaire chez Wiplay Music",
      "company": "Wiplay Music",
      "period": "14/03/2025 - 11/07/2025",
      "description": "Participation à la gestion du DSI de Wiplay Music",
      "fullDescription": "En tant que  membre du DSI, j'ai participé à l'automatisation de la gestion des données de Wiplay Music, en utilisant Make et Zapier comme logiciels low code, Node.js pour le backend et les requêtes API. Mes responsabilités incluaient la gestion des erreurs rencontrées dans tous les process actuels, les nombreuses demandes faites par lses autres services afin de faciliter leur travail, la mise en place d'un système de tunnel de vente amenant le client directement au paiement sans passer par une interaction humaine et finalement la gestion des tests d'intégration et d'acceptation liés à l'application en cours de développement.",
      "imageUrl": "assets/images/wiplay.png",
      "skills": [
        { "name": "Make" },
        { "name": "Zapier" },
        { "name": "Node.js" },
        { "name": "AWS" },
        { "name": "Travail en équipe" },
        { "name": "Gestion d'API" },
        { "name": "Gestion des tests" }
      ]
    }
  ],
  "projects": [
    {
      "title": "Affichage des vols dans un un aéroport",
      "description": "Application C permettant l'affichage de données tirées d'un fichier .csv sur un tableau.",
      "fullDescription": "Il s'agit d'une application C qui permet d'afficher les vols dans un aéroport en fonction de leur destination. Les données sont tirées d'un fichier .csv et affichées sur un tableau. L'application permet de rechercher les vols à venir à l'aide de différents criètres, d'afficher les vols des 3 prochaines heures mais également les passagers de ce vol. Cette application a été développée avec pour but d'apprendre à maitriser les pointeurs en C, mais également la notion d'extraction de données et de structure de données.",
      "imageUrl": "assets/images/application_gestion_vols.png",
      "githubUrl": "https://github.com/Senelet/BUT1-s1-gestion-aeroport",
      "skills": [
        { "name": "C" },
        { "name": "Algorithmie" },
        { "name": "Travail en équipe" }
      ]
    },
    {
      "title": "Application de gestion de vol d'une compagnie aérienne",
      "description": "Une application Java permettant la gestion de conflit de vols entre plusieurs avions.",
      "fullDescription": "Application Java permettant la gestion de conflit de vols entre plusieurs avions. Cette application a été développée avec pour but d'apprendre à maitriser Java, mais également la notion d'interface avec l'utilisateur, le système de Listeners, les tests (unitaires dans notre cas). Ce projet aura également permis l'implémentation de la notion mathématique des graphes, des parcours et des colorations.",
      "imageUrl": "assets/images/application_vols.png",
      "githubUrl": "https://github.com/Senelet/BUT1-s2-gestion-vols",
      "skills": [
        { "name": "Java" },
        { "name": "Algorithmie" },
        { "name": "Travail en équipe" },
        { "name": "Mathématiques" }
      ]
    },
    {
      "title": "Site web de présentation des transports sur le campus de l'IUT",
      "description": "Un site web statique permettant de présenter les transports sur le campus de l'IUT.",
      "fullDescription": "Un site web statique permettant de présenter les différents moyens de transports sur le campus de l'IUT. Ce site a été développé avec pour but d'apprendre à maitriser HTML et CSS, il met en valeur les différents moyens de transports pouvant être utilisés sur le campus de l'IUT par les étudiants.",
      "imageUrl": "assets/images/uni_doux.png",
      "githubUrl": "https://github.com/Senelet/uni-doux",
      "skills": [
        { "name": "HTML" },
        { "name": "CSS" }
      ]
    },
    {
      "title": "Gestionnaire de réservation de livre pour une bibliothèque",
      "description": "Un site web permettant la gestion de réservation de livre pour une bibliothèque.",
      "fullDescription": "Un site web permettant la gestion de réservation de livre pour une bibliothèque. Ce site web a été développé dans le cadre d'un projet académique, par groupe de 4, avec les langages PHP, HTML, CSS, Javascript et SQL. Ce site permet à l'utilisateur de parcourir un catalogue de livres présent dans la bibliothèque, de les réserver ou d'acheter l'exemplaire digital voulu.",
      "imageUrl": "assets/images/libris.png",
      "githubUrl": "https://forge.univ-lyon1.fr/p2310628/libris",
      "skills": [
        { "name": "Java" },
        { "name": "Algorithmie" },
        { "name": "Travail en équipe" },
        { "name": "Mathématiques" }
      ]
    },
    {
      "title": "Organisation d'un tunnel de vente pour une entreprise",
      "description": "Création et développement d'un tunnel de vente pour une entreprise",
      "fullDescription": "Le tunnel de vente a été développé à l'aide du CRM Hubspot, ainsi que l'API associée. Le but du projet était d'augmenter le nombre de signatrues des clients en limitant les interactions humaines. Il a fallu générer un formulaire personnalisé, à l'aide du CRM, récupérer les données de celui-ci, et ensuite créer les transactions et le devis associé. Pour toutes les requêtes HTTP, le Node.js a été utilisé, le tout au sein du CRM Hubspot. Il a également fallu dialoguer avec l'ERP Ogust, associé à Hubspot, pour la gestion des règlements.",
      "imageUrl": "assets/images/devis_tunnel.png",
      "githubUrl": "Pas de lien pour le moment",
      "skills": [
        { "name": "Node.js" },
        { "name": "Travail en équipe"},
        { "name": "Gestion d'API"}
      ]
    },
    {
      "title": "Application de reporting pour le suivi des contrats",
      "description": "Développement d'une application Java pour l'analyse et le reporting des données clients d'Ogust",
      "fullDescription": "Développement d'une application Java permettant l'analyse des données clients exportées depuis la plateforme Ogust. L'application permet de traiter plusieurs fichiers d'export Excel pour générer des rapports détaillés sur l'état des contrats clients. Les fonctionnalités principales incluent : l'analyse des étapes du cycle de vie des contrats, le calcul du temps passé à chaque étape, l'identification des clients bloqués, et la génération de graphiques par commercial. L'application a été développée en Java avec IntelliJ IDEA, en utilisant des bibliothèques pour la manipulation de fichiers Excel et la création de graphiques. Le projet a nécessité plusieurs itérations pour gérer les variations dans la structure des fichiers d'export et l'ajout de nouvelles fonctionnalités comme l'intégration des données commerciales. L'application a été finalement packagée en un fichier .jar exécutable pour faciliter son déploiement.",
      "imageUrl": "assets/images/reporting_app.png",
      "githubUrl": "Pas de lien pour le moment",
      "skills": [
        { "name": "Java" },
        { "name": "Algorithmie" },
        { "name": "Travail en équipe" },
        { "name": "Automatisation" }
      ]
    },
    {
      "title": "BugTracking pour une application mobile",
      "description": "Détection des bugs d'intégration liés à l'application mobile de Wiplay Music",
      "fullDescription": "Détection des bugs d'intégration liés à l'application mobile de Wiplay Music. Ce projet consistait à détecter les diffents problèmes rencontrés par l'application mobile de Wiplay Music, et à les faire remonter à l'quipe de développeurs. Pour ce faire, il a fallu mettre en place un BugTracking, avec un système de tickets, et un système de suivi des bugs. ",
      "imageUrl": "assets/images/appli.png",
      "githubUrl": "Pas de lien pour le moment",
      "skills": [
        { "name": "Travail en équipe"},
        { "name": "Gestion d'API"},
        { "name": "Gestion des tests"},
        { "name": "Docker"},
        { "name": "AWS"},
        { "name": "MariaDB"},
        { "name": "React Native"},
        { "name": "Expo"},
        { "name": "Golang"}
      ]
    }

  ]
} 